content-org/music.org
#+HUGO_BASE_DIR: ../
#+HUGO_SECTION: music

* Guitar 
  :PROPERTIES:
  :EXPORT_FILE_NAME: guitar 
  :EXPORT_HUGO_CUSTOM_FRONT_MATTER: :toc true :type docs :linktitle "Guitar"
  :EXPORT_HUGO_MENU: menu "music"
  :END:


** Desi Serna - Fretboard Theory
*** Chapter 1: Review
    - Notes on strings
    - Steps
    - Octaves
    
*** Chapter 2: Pentatonic Scale
    - Scale used to create riffs, solos and basslines
    - Scale Patterns
    - Connecting Shapes
    - Fingering
    - Major and Minor Tonalities
    
*** Chapter 3: CAGED Chord System
    Moveable Shapes
    Arpeggios
    Inversions
    Voicings
    Partial Forms
    
*** Chapter 4: Combining Pentatonic Scale and CAGED Chords
    Combining scale patterns and chord forms
    Major and Minor Tonalities

*** Chapter 5: The Major Scale
    Scale used to create melodies, riffs, solos and basslines
    Scale construction
    Connect to CAGED System
    Step Formula
    Keys
    Scale Patterns
    Comparison with Pentonic Scale

*** Chapter 6: Chord Progressions
    Six commonly used chords recognized by number
    Triads
    Chord Construction
    Intervals
    Major scale chords patterns
    Playing by numbers
    Progressions
    
*** Chapter 7: Roots, Key and Applying Scales
    How do scales, chords, and keys fil together?
    Applying Pentatonic Scale
    Identifying root chords
    Outlining a chord progression
    Blues
    Applying the major scale
    Determining the key
    Combining pentatonic and major scales
    Root/Key Dilemma

*** Chapter 8: Modes
    Greater clarity on the root/key relationship
    Seven possible roots of the major scale
    Greek modes names
    Sound characteristics
    Key changes
    Modes and the blues

*** Chapter 9: Intervals
    Distance between notes
    Music's little ruler
    Commonly used intervals
    Inverted intervals
    Thirds
    Fifths
    Sixths
    Octaves

*** Chapter 10: Chord Extensions
    Adding remaining intervals of the major scale to chords
    
    Chord patterns with sevenths
    CAGED with sevenths
    Seconds, fourths, sixths, ninths
    Chord build chart
    Chord shapes



