content/music/guitar.md
+++
title = "Guitar"
author = ["Monib Ahmed"]
draft = false
toc = true
type = "docs"
linktitle = "Guitar"
[menu.music]
  weight = 1001
  identifier = "guitar"
+++

## Desi Serna - Fretboard Theory {#desi-serna-fretboard-theory}


### Chapter 1: Review {#chapter-1-review}

-   Notes on strings
-   Steps
-   Octaves


### Chapter 2: Pentatonic Scale {#chapter-2-pentatonic-scale}

-   Scale used to create riffs, solos and basslines
-   Scale Patterns
-   Connecting Shapes
-   Fingering
-   Major and Minor Tonalities


### Chapter 3: CAGED Chord System {#chapter-3-caged-chord-system}

Moveable Shapes
Arpeggios
Inversions
Voicings
Partial Forms


### Chapter 4: Combining Pentatonic Scale and CAGED Chords {#chapter-4-combining-pentatonic-scale-and-caged-chords}

Combining scale patterns and chord forms
Major and Minor Tonalities


### Chapter 5: The Major Scale {#chapter-5-the-major-scale}

Scale used to create melodies, riffs, solos and basslines
Scale construction
Connect to CAGED System
Step Formula
Keys
Scale Patterns
Comparison with Pentonic Scale


### Chapter 6: Chord Progressions {#chapter-6-chord-progressions}

Six commonly used chords recognized by number
Triads
Chord Construction
Intervals
Major scale chords patterns
Playing by numbers
Progressions


### Chapter 7: Roots, Key and Applying Scales {#chapter-7-roots-key-and-applying-scales}

How do scales, chords, and keys fil together?
Applying Pentatonic Scale
Identifying root chords
Outlining a chord progression
Blues
Applying the major scale
Determining the key
Combining pentatonic and major scales
Root/Key Dilemma


### Chapter 8: Modes {#chapter-8-modes}

Greater clarity on the root/key relationship
Seven possible roots of the major scale
Greek modes names
Sound characteristics
Key changes
Modes and the blues


### Chapter 9: Intervals {#chapter-9-intervals}

Distance between notes
Music's little ruler
Commonly used intervals
Inverted intervals
Thirds
Fifths
Sixths
Octaves


### Chapter 10: Chord Extensions {#chapter-10-chord-extensions}

Adding remaining intervals of the major scale to chords

Chord patterns with sevenths
CAGED with sevenths
Seconds, fourths, sixths, ninths
Chord build chart
Chord shapes